lax_coordinates = (33.9425, -118.408056)
city, yaer, pop, chg, area = ('Tokyo', 2003, 32_450, 0.66, 8014)

traveler_ids = [
    ('USA', '3119885'),
    ('BRA', 'CE789890'),
    ('ESP', 'XDA232432'),
    ]


for passport in sorted(traveler_ids):
    print('%s/%s' % passport)

for county, _ in traveler_ids:
    print(county)

capitals = [('Москва', 'MOW', 12678079, (55.75, 37.61)),
            ('Токио', 'TYO', 13929286, (35.68, 139.69)),
            ('Пекин', 'BJS', 21516000, (39.90, 116.40)),
            ('Берлин', 'BER', 3769495, (52.52, 13.40)),
            ('Лондон', 'LON', 8982000, (51.51, -0.13)),
            ('Стамбул', 'IST', 15029000, (41.04, 28.99)),
            ('Париж', 'PAR', 11017230, (48.86, 2.35)),
            ('Рим', 'ROM', 2872800, (41.90, 12.48)),
            ('Дели', 'DEL', 28514000, (28.70, 77.10)),
            ('Нью-Йорк', 'NYC', 18713220, (40.73, -73.93)),
            ('Аддис-Абеба', 'ADD', 3103673, (9.02, 38.75)),
            ('Афины', 'ATH', 3168846, (37.98, 23.72)),
            ('Каир', 'CAI', 20484950, (30.06, 31.25)),
            ('Ханой', 'HAN', 7780800, (21.03, 105.85)),
            ('Мехико', 'MEX', 8918653, (19.43, -99.13)),
            ('Канберра', 'CBR', 457194, (-35.28, 149.12)),
            ('Рейкьявик', 'REK', 123300, (64.14, -21.94)),
            ('Сингапур', 'SIN', 5638700, (1.29, 103.85)),
            ('Сеул', 'SEL', 9720846, (37.57, 126.98)),
            ('Мадрид', 'MAD', 6640705, (40.42, -3.71)),
            ('Бангкок', 'BKK', 8280925, (13.75, 100.50)),
            ('Киев', 'IEV', 2884000, (50.45, 30.52)),
            ('Осло', 'OSL', 700000, (59.91, 10.75)),
            ('Варшава', 'WAW', 1765000, (52.23, 21.01))]

# def main():
#     print(f'{"":15} | {"latitude":>9} | {"longitude":>9}')
#     for name, _, _, (lat, lon) in capitals:
#         if lon <= 0:
#             print(f'{name:15} | {lat:9.4f} | {lon:9.4f} ')


def main():
    print(f'{"":15} | {"latitude":>9} | {"longitude":>9}')
    for record in capitals:
        match record:
            case [name, _, _, (lat, lon)] if lon <= 0:
                print(f'{name:15} | {lat:9.4f} | {lon:9.4f} ')

main()
